{
    "main_topic": {
        "author": "SeshuRaju 🧘‍♂️",
        "title": "lmsys chat 1m (is Allowed? - dataset consists of user interactions from the ChatBot Arena) [Solved - Allowed]",
        "content": "## [IMSYS Chat 1M](https://huggingface.co/datasets/lmsys/lmsys-chat-1m)\n\n## KeyValue\n\n| Metric | Value |\n| --- | --- |\n| Conversations | 1,000,000 |\n| Models | 25 |\n| Users | 210,479 |\n| Languages | 154 |\n| Avg. # Turns per Sample | 2.0 |\n| Avg. # Tokens per Prompt | 69.5 |\n| Avg. # Tokens per Response | 214.5 |\n\n## [Paper - LMSYS-CHAT-1M: A LARGE-SCALE REAL-WORLD LLM CONVERSATION DATASET](https://arxiv.org/pdf/2309.11998)\n\n- LMSYS-Chat-1M is collected from April to August 2023 - on website [https://chat.lmsys.org/](https://chat.lmsys.org/)\n\n- The dataset contains raw conversation text without any processing. To ensure the safe release of\n\n  data, we have made our best efforts to remove conversations that contain personally identifiable\n\n  information (PII).\n\n- The dataset includes one million conversations from 25 state-of-the-art LLMs with 210K users\n\n  across more than 150 languages.\n\n- We remove prompts that are either too short (fewer than 32 characters) or too long (more than 1536 characters).\n\n- Biased user distribution : The majority of users of our website are LLM hobbyists and researchers who are interested in trying and testing the latest LLMs. This suggests that the data\n\n  might not fully represent the broader population. For instance, everyday users or individuals\n\n  from different professions might interact with the LLMs in varied ways. Consequently, results\n\n  derived from this dataset might not generalize across all user groups.\n\n- Containing repeated and low-quality data : The lack of user registration and data filtering can\n\n  result in a significant amount of low-quality and duplicate data. However, we choose to not\n\n  apply any filtering on purpose to reflect the real-world distribution.\n\n- No human preference annotations. This dataset contains raw conversations without any human\n\n  preference annotations. While our website does collect some user votes, we plan to examine\n\n  the quality further before releasing them. We encourage the community to check the human\n\n  preference data released in (Zheng et al., 2023).\n\n# We can compare the Kaggle dataset with 1m dataset\n\n- is PII added and removed more similar prompts or questions as suggested by paper ?\n\n- Generate targets for the filtered dataset using GPT-4\n\n- We can probe LB to check is this data topics exists in private LB ( as 20 clusters  for random 100k as per paper )\n\n",
        "date": "Fri May 03 2024 14:00:35 GMT+0900 (日本標準時)",
        "votes": "24"
    },
    "comments": [
        {
            "author": "Lisa DunlapCompetition Host",
            "content": "Hello! Organizer here: yes it is allowed :)\n\n",
            "date": "Posted 3 months ago",
            "votes": "13",
            "reply": []
        },
        {
            "author": "Gaurav Rawat",
            "content": "Had exactly the same question about some of the lmsys datasets on hugging face ideally most are open I am guessing should be fine\n\n",
            "date": "Posted 3 months ago",
            "votes": "1",
            "reply": [
                {
                    "author": "SeshuRaju 🧘‍♂️Topic Author",
                    "content": "I expected the same, till now organiser not conformed. maybe we can consider it as Yes\n\n",
                    "date": "Posted 3 months ago  ·  323rd in this Competition",
                    "votes": "1",
                    "reply": []
                }
            ]
        }
    ]
}