{
    "main_topic": {
        "author": "Myles O'Neill",
        "title": "This Competition has an Official Discord Channel",
        "content": "In addition to this competition forum, you can continue the discussion in our official Kaggle Discord Server here: \n\n# [discord.gg/kaggle](http://discord.gg/kaggle)\n\nThe Discord is a great place to ask getting started questions, chat about the nuances of this competition, and connect with potential team mates. Learn more about Discord at our [announcement here](https://www.kaggle.com/discussions/general/429933). Here are a few things to keep in mind though:\n\n1. Discord Competition Channels are 'Public'\n\nDiscord channels for specific competitions are considered 'public' spaces where you are allowed to talk about competition details (it will not count as private sharing).\n\n2. Discord Competition Channels are Not Monitored by Staff\n\nKaggle Staff and Hosts running competitions will not monitor Discord or be available to answer questions in Discord. Always post important questions in the forums.\n\n3. Keep the Good Stuff on the Forums\n\nPlease keep important questions, insights, writeups, and other valuable conversation on the Kaggle forums. Discord is intended to be a more casual space to discuss competitions and help each other, we want to keep all the best information on the forums.\n\n4. Remember to never privately share competition code or data\n\nPlease remember that private sharing of competition code or data is, as always, not permitted. Code sharing must always be done publicly through the Kaggle forums/notebooks.\n\nI hope you’ll join us to chat on Discord soon!\n\n",
        "date": "Fri May 03 2024 04:35:29 GMT+0900 (日本標準時)",
        "votes": "18"
    },
    "comments": [
        {
            "author": "Abel Punnoose",
            "content": "The best place to learn RLHF\n\n",
            "date": "Posted 2 months ago",
            "votes": "0",
            "reply": []
        },
        {
            "author": "Othmane Manessouri",
            "content": "Even though i'm still on my learning process i'll try to get better at this\n\n",
            "date": "Posted 2 months ago",
            "votes": "0",
            "reply": []
        },
        {
            "author": "kartikey bartwal",
            "content": "Thank You. I absolutely love Kaggle's collaboration mindset 🙌\n\n",
            "date": "Posted 2 months ago",
            "votes": "0",
            "reply": [
                {
                    "author": "Yuwen He",
                    "content": "I agree, I can learn a lot here\n\n",
                    "date": "Posted 2 months ago",
                    "votes": "0",
                    "reply": []
                }
            ]
        }
    ]
}