{
    "main_topic": {
        "author": "eli plutchok",
        "title": "Why So Little",
        "content": "Hello Everyone, \n\nI'm new to kaggle. I'm wondering why the competition organizers gave us a data set of just ~60K items when they surely must have a lot more from the same place. Should I expect them to release more at a later date, or are they just trying to make it extra challenging for us?\n\n(The LMSYS arena leaderboard is based on over 900k votes: [https://chat.lmsys.org/?leaderboard](https://chat.lmsys.org/?leaderboard))\n\n",
        "date": "Wed May 08 2024 13:44:26 GMT+0900 (日本標準時)",
        "votes": "4"
    },
    "comments": [
        {
            "author": "Valentin Werner",
            "content": "There are many reasons why a company may not want to disclose all of their data. I think 60k samples are more than what we often see for challenges. This is already a size where you are taking a small subset to test things first.\n\n",
            "date": "Posted 3 months ago  ·  38th in this Competition",
            "votes": "3",
            "reply": [
                {
                    "author": "eli plutchokTopic Author",
                    "content": "Ok, I get it. They don't want people to have their proprietary data. But still, they won't get the best pre-trained models by withholding the data. Do they care mainly about the code used to train the models? I guess, my dumb question is: what is the primary objective of, LMSYS, the company sponsoring this? \n\n",
                    "date": "Posted 3 months ago  ·  1077th in this Competition",
                    "votes": "1",
                    "reply": [
                        {
                            "author": "Valentin Werner",
                            "content": "They are licensed the winning solutions (see Rules #A1). These companies are often able to transfer solutions to their own data themselves. \n\nHowever, company motivation for challenges may vary: For example, they maybe want to proof a concept or make a study whether things are achievable. Opening such a challenge to kaggle is smart because doing the same thing internally will often be more expensive and less diverse in solution approaches.\n\n",
                            "date": "Posted 3 months ago  ·  38th in this Competition",
                            "votes": "2",
                            "reply": []
                        }
                    ]
                }
            ]
        }
    ]
}